DSN SYSTEM(DB9G)
BIND PACKAGE(PACKMP) OWNER(IBMUSER) MEMBER(PROGMAIN) -
    ACTION(REPLACE) VALIDATE(BIND) ISOLATION(UR)
BIND PLAN(IBM0001) -
    PKLIST(PACKMP.*) -
    ACTION(REPLACE)
END
