         01  WK-ACCEPT.
             05 WK-FUNCAO-ACCEPT       PIC X           VALUE SPACES.
             05 WK-CODFUN-ACCEPT       PIC X(4)        VALUE SPACES.
             05 WK-NOMEFUN-ACCEPT      PIC X(30)       VALUE SPACES.
             05 WK-SALARIOFUN-ACCEPT   PIC 9(6)V99     VALUE ZEROS.
             05 WK-DEPTOFUN-ACCEPT     PIC X(3)        VALUE SPACES.
             05 WK-ADMISSFUN-ACCEPT    PIC X(11)       VALUE SPACES.
             05 WK-IDADEFUN-ACCEPT     PIC 99          VALUE ZEROS.
         77  WK-EMAILFUN-ACCEPT        PIC X(30)       VALUE SPACES.