      * Variáveis de controle SQL
       01  WK-SQL-CONTROLE.
           05 WK-SQL-OK              PIC X(01).
           05 WK-SQL-STATUS          PIC X(20).
           
       01  WK-SQLCODE-EDIT           PIC -9999.